---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ExternalResourceServerUtils Methods
ExternalResourceServerUtils Class See Also Send Feedback
---

The ExternalResourceServerUtils type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | IsValidShortName | Checks whether the name is a valid short name for the external resource server. |
|  | ServerSupportsAssemblyCodeData | Checks that the server referenced by the given ExternalResourceReference supports AssemblyCodeData. |
|  | ServerSupportsCADLinks | Checks that the server referenced by the given ExternalResourceReference supports CAD links. |
|  | ServerSupportsIFCLinks | Checks that the server referenced by the given ExternalResourceReference supports IFC links. |
|  | ServerSupportsKeynotes | Checks that the server referenced by the given ExternalResourceReference supports KeynoteTable data. |
|  | ServerSupportsRevitLinks | Checks that the server referenced by the given ExternalResourceReference supports Revit links. |

# See Also

ExternalResourceServerUtils Class

Autodesk.Revit.DB Namespace